examples/flows/compiled/decorator_callsite/flow.dot
digraph "decorator_callsite_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    end_decorator_callsite_flow [label="end_decorator_callsite_flow", fillcolor=palegreen];
    enricher [label="enricher", fillcolor=lightblue];
    router_decorator_callsite_flow_line_29_seq_1 [label="router_decorator_callsite_flow_line_29_seq_1", fillcolor=wheat];
    start_decorator_callsite_flow [label="start_decorator_callsite_flow", fillcolor=palegreen];
    validator [label="validator", fillcolor=lightblue];

    start_decorator_callsite_flow -> router_decorator_callsite_flow_line_29_seq_1;
    router_decorator_callsite_flow_line_29_seq_1 -> validator;
    router_decorator_callsite_flow_line_29_seq_1 -> enricher;
}
