examples/flows/compiled/decorator_callsite/flow.mmd
flowchart TD
    %% Flow: decorator_callsite

    enricher[enricher]
    router_decorator_callsite_flow_line_29_seq_1{{router_decorator_callsite_flow_line_29_seq_1}}
    start_decorator_callsite_flow([start_decorator_callsite_flow])
    validator[validator]
    __end__((( )))

    start_decorator_callsite_flow --> router_decorator_callsite_flow_line_29_seq_1
    router_decorator_callsite_flow_line_29_seq_1 --> validator
    validator --> enricher
    enricher --> __end__
